# -*- coding: utf-8 -*-
"""
Created on Sun Jul 31 15:22:41 2022

@author: iammu
"""
#Removing the Ahraab

from camel_tools.utils.dediac import dediac_ar



def nameArrangeFunction(sent_split2):
    for i in range(len(sent_split2)):
        if(sent_split2[i].__contains__('-')):
            firstDash=sent_split2[i].index('-')
            lastDash= sent_split2[i].rfind('-')
            
            nameCut = sent_split2[i][firstDash+1:lastDash]
            if(nameCut.__contains__("ابن")):
                sent_split2[i-1]=sent_split2[i-1]+" "+nameCut
                sent_split2[i]=sent_split2[i][lastDash+1:]
            else:
                dum=sent_split2[i]
                sent_split2[i] = dum[:firstDash]
                sent_split2.append(dum[lastDash+1:])
                
        else:
            sent_split2[i]=sent_split2[i]
                     
    return sent_split2



#sentence = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ الْقَعْنَبِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ مُحَمَّدٍ، - يَعْنِي ابْنَ عَمْرٍو - عَنْ أَبِي سَلَمَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا ذَهَبَ الْمَذْهَبَ أَبْعَدَ ‏"
#sentence="حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ عَبْدِ الْمَلِكِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أَرَادَ الْبَرَازَ انْطَلَقَ حَتَّى لاَ يَرَاهُ أَحَدٌ "

#sentence='''حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا أَبُو التَّيَّاحِ، حَدَّثَنِي شَيْخٌ، قَالَ لَمَّا قَدِمَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ الْبَصْرَةَ فَكَانَ يُحَدَّثُ عَنْ أَبِي مُوسَى، فَكَتَبَ عَبْدُ اللَّهِ إِلَى أَبِي مُوسَى يَسْأَلُهُ عَنْ أَشْيَاءَ، فَكَتَبَ إِلَيْهِ أَبُو مُوسَى إِنِّي كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ فَأَرَادَ أَنْ يَبُولَ فَأَتَى دَمِثًا فِي أَصْلِ جِدَارٍ فَبَالَ ثُمَّ قَالَ صلى الله عليه وسلم ‏ "‏ إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَبُولَ فَلْيَرْتَدْ لِبَوْلِهِ مَوْضِعًا ‏"‏ ‏.‏
#'''

#sentence='حَدَّثَنَا الْحَسَنُ بْنُ عَمْرٍو، - يَعْنِي السَّدُوسِيَّ - حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ عَبْدِ الْعَزِيزِ، - هُوَ ابْنُ صُهَيْبٍ - عَنْ أَنَسٍ، بِهَذَا الْحَدِيثِ قَالَ ‏"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ ‏"‏ ‏.‏ وَقَالَ شُعْبَةُ وَقَالَ مَرَّةً ‏"‏ أَعُوذُ بِاللَّ'


#sentence='حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ أَنَّ الْحَارِثَ بْنَ هِشَامٍ ـ رضى الله عنه ـ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ يَأْتِيكَ الْوَحْىُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ "‏ أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ ـ وَهُوَ أَشَدُّهُ عَلَىَّ ـ فَيُفْصَمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ، وَأَحْيَانًا يَتَمَثَّلُ لِيَ الْمَلَكُ رَجُلاً فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ ‏"‏‏.‏ قَالَتْ عَائِشَةُ رضى الله عنها وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْىُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ، فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا‏.'

#sentence='''حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ، يَقُولُ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَهْلِ نَجْدٍ، ثَائِرُ الرَّأْسِ، يُسْمَعُ دَوِيُّ صَوْتِهِ، وَلاَ يُفْقَهُ مَا يَقُولُ حَتَّى دَنَا، فَإِذَا هُوَ يَسْأَلُ عَنِ الإِسْلاَمِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ‏"‏ خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ ‏"‏‏.‏ فَقَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏"‏ لاَ، إِلاَّ أَنْ تَطَوَّعَ ‏"‏‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏"‏ وَصِيَامُ رَمَضَانَ ‏"‏‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهُ قَالَ ‏"‏ لاَ، إِلاَّ أَنْ تَطَوَّعَ ‏"‏‏.‏ قَالَ وَذَكَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم الزَّكَاةَ‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏"‏ لاَ، إِلاَّ أَنْ تَطَوَّعَ ‏"‏‏.‏ قَالَ فَأَدْبَرَ الرَّجُلُ وَهُوَ يَقُولُ وَاللَّهِ لاَ أَزِيدُ عَلَى هَذَا وَلاَ أَنْقُصُ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏"‏ أَفْلَحَ إِنْ صَدَقَ ‏"‏‏.‏'''

# sentence='''حَدَّثَنَا إِسْحَاقُ بْنُ يَزِيدَ، أَخْبَرَنَا شُعَيْبُ بْنُ إِسْحَاقَ، قَالَ الأَوْزَاعِيُّ أَخْبَرَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، أَنَّ عَمْرَو بْنَ يَحْيَى بْنِ عُمَارَةَ، أَخْبَرَهُ عَنْ أَبِيهِ، يَحْيَى بْنِ عُمَارَةَ بْنِ أَبِي الْحَسَنِ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ ـ رضى الله عنه ـ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ "‏ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوْسُقٍ صَدَقَةٌ ‏"‏‏.‏
# '''
#sentence='حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا مِسْعَرٌ، وَسُفْيَانُ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ الثَّقَفِيِّ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ الْوَالِبِيِّ، عَنْ أَسْمَاءَ بْنِ الْحَكَمِ الْفَزَارِيِّ، عَنْ عَلِيٍّ، رَضِيَ اللَّهُ عَنْهُ قَالَ كُنْتُ إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا نَفَعَنِي اللَّهُ بِمَا شَاءَ مِنْهُ وَإِذَا حَدَّثَنِي عَنْهُ غَيْرِي اسْتَحْلَفْتُهُ فَإِذَا حَلَفَ لِي صَدَّقْتُهُ وَإِنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ حَدَّثَنِي وَصَدَقَ أَبُو بَكْرٍ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ رَجُلٍ يُذْنِبُ ذَنْبًا فَيَتَوَضَّأُ فَيُحْسِنُ الْوُضُوءَ قَالَ مِسْعَرٌ وَيُصَلِّي وَقَالَ سُفْيَانُ ثُمَّ يُصَلِّي رَكْعَتَيْنِ فَيَسْتَغْفِرُ اللَّهَ عَزَّ وَجَلَّ إِلَّا غَفَرَ لَهُ‏.‏'
#sentence='أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ أَخْبَرَنَا غَيْلاَنُ بْنُ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَسْتَنُّ وَطَرَفُ السِّوَاكِ عَلَى لِسَانِهِ وَهُوَ يَقُولُ ‏ "‏ عَأْعَأْ ‏"‏ ‏.‏'

#-calling name-
#sentence='أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - قَالَ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، قَالَ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ أَقْبَلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَمَعِي رَجُلاَنِ مِنَ الأَشْعَرِيِّينَ أَحَدُهُمَا عَنْ يَمِينِي وَالآخَرُ عَنْ يَسَارِي وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتَاكُ فَكِلاَهُمَا سَأَلَ الْعَمَلَ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ نَبِيًّا مَا أَطْلَعَانِي عَلَى مَا فِي أَنْفُسِهِمَا وَمَا شَعَرْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ فَكَأَنِّي أَنْظُرُ إِلَى سِوَاكِهِ تَحْتَ شَفَتِهِ قَلَصَتْ فَقَالَ ‏ "‏ إِنَّا لاَ - أَوْ لَنْ - نَسْتَعِينَ عَلَى الْعَمَلِ مَنْ أَرَادَهُ وَلَكِنِ اذْهَبْ أَنْتَ ‏"‏ ‏.‏ فَبَعَثَهُ عَلَى الْيَمَنِ ثُمَّ أَرْدَفَهُ مُعَاذُ بْنُ جَبَلٍ رضى الله عنهما ‏.‏'
#sentence='أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ، قَالَ حَدَّثَنَا عِيسَى، - وَهُوَ ابْنُ يُونُسَ - عَنْ مِسْعَرٍ، عَنِ الْمِقْدَامِ، - وَهُوَ ابْنُ شُرَيْحٍ - عَنْ أَبِيهِ، قَالَ قُلْتُ لِعَائِشَةَ بِأَىِّ شَىْءٍ كَانَ يَبْدَأُ النَّبِيُّ صلى الله عليه وسلم إِذَا دَخَلَ بَيْتَهُ قَالَتْ بِالسِّوَاكِ ‏.‏'
#sentence='أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ وَكِيعٍ، عَنْ هِشَامٍ، عَنْ يَحْيَى، - هُوَ ابْنُ أَبِي كَثِيرٍ - عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ "‏ إِذَا دَخَلَ أَحَدُكُمُ الْخَلاَءَ فَلاَ يَمَسَّ ذَكَرَهُ بِيَمِينِهِ ‏"‏ ‏.‏'
#sentence ='أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، قَالَ أَخْبَرَنِي الْقَعْقَاعُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ "‏ إِنَّمَا أَنَا لَكُمْ مِثْلُ الْوَالِدِ أُعَلِّمُكُمْ إِذَا ذَهَبَ أَحَدُكُمْ إِلَى الْخَلاَءِ فَلاَ يَسْتَقْبِلِ الْقِبْلَةَ وَلاَ يَسْتَدْبِرْهَا وَلاَ يَسْتَنْجِ بِيَمِينِهِ ‏"‏ وَكَانَ يَأْمُرُ بِثَلاَثَةِ أَحْجَارٍ وَنَهَى عَنِ الرَّوْثِ وَالرِّمَّةِ ‏.‏'
#sentence='أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ زُهَيْرٍ، عَنْ أَبِي إِسْحَاقَ، قَالَ لَيْسَ أَبُو عُبَيْدَةَ ذَكَرَهُ وَلَكِنْ عَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ عَنْ أَبِيهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ، يَقُولُ أَتَى النَّبِيُّ صلى الله عليه وسلم الْغَائِطَ وَأَمَرَنِي أَنْ آتِيَهُ بِثَلاَثَةِ أَحْجَارٍ فَوَجَدْتُ حَجَرَيْنِ وَالْتَمَسْتُ الثَّالِثَ فَلَمْ أَجِدْهُ فَأَخَذْتُ رَوْثَةً فَأَتَيْتُ بِهِنَّ النَّبِيَّ صلى الله عليه وسلم فَأَخَذَ الْحَجَرَيْنِ وَأَلْقَى الرَّوْثَةَ وَقَالَ ‏ "‏ هَذِهِ رِكْسٌ ‏"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ الرِّكْسُ طَعَامُ الْجِنِّ'

#sentence='حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ تَوَضَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم وُضُوءَهُ لِلصَّلاَةِ غَيْرَ رِجْلَيْهِ، وَغَسَلَ فَرْجَهُ، وَمَا أَصَابَهُ مِنَ الأَذَى، ثُمَّ أَفَاضَ عَلَيْهِ الْمَاءَ، ثُمَّ نَحَّى رِجْلَيْهِ فَغَسَلَهُمَا، هَذِهِ غُسْلُهُ مِنَ الْجَنَابَةِ‏.‏'
#sentence = 'حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ أَنَّ الْحَارِثَ بْنَ هِشَامٍ ـ رضى الله عنه ـ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ يَأْتِيكَ الْوَحْىُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ "‏ أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ ـ وَهُوَ أَشَدُّهُ عَلَىَّ ـ فَيُفْصَمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ، وَأَحْيَانًا يَتَمَثَّلُ لِيَ الْمَلَكُ رَجُلاً فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ ‏"‏‏.‏ قَالَتْ عَائِشَةُ رضى الله عنها وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْىُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ، فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا‏'
sentence='''أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ،حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - قَالَ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، قَالَ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ أَقْبَلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَمَعِي رَجُلاَنِ مِنَ الأَشْعَرِيِّينَ أَحَدُهُمَا عَنْ يَمِينِي وَالآخَرُ عَنْ يَسَارِي وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتَاكُ فَكِلاَهُمَا سَأَلَ الْعَمَلَ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ نَبِيًّا مَا أَطْلَعَانِي عَلَى مَا فِي أَنْفُسِهِمَا وَمَا شَعَرْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ فَكَأَنِّي أَنْظُرُ إِلَى سِوَاكِهِ تَحْتَ شَفَتِهِ قَلَصَتْ فَقَالَ ‏ ‏ إِنَّا لاَ - أَوْ لَنْ - نَسْتَعِينَ عَلَى الْعَمَلِ مَنْ أَرَادَهُ وَلَكِنِ اذْهَبْ أَنْتَ ‏‏ ‏.‏ فَبَعَثَهُ عَلَى الْيَمَنِ ثُمَّ أَرْدَفَهُ مُعَاذُ بْنُ جَبَلٍ رضى الله عنهما ‏.‏'''

print(sentence)

without_ahraab = dediac_ar(sentence)
print(without_ahraab)

#_________________________________________________
#
#Tokenizer
from camel_tools.tokenizers.word import simple_word_tokenize

#sent_split = simple_word_tokenize(without_ahraab)
sent_split=without_ahraab.split("،")
print(sent_split)
countDash=0
for i in range(len(sent_split)):
    countDash+=sent_split[i].count('-')

if(countDash>=2):
    sent_split=nameArrangeFunction(sent_split)
    
#_______________________________________________

#NER
from camel_tools.ner import NERecognizer

ner = NERecognizer('CAMeL-Lab/bert-base-arabic-camelbert-mix-ner')
# sentence = simple_word_tokenize()
for i in range(len(sent_split)):
    if(sent_split[i].__contains__("وهو ابن")):
        sent_split[i] = sent_split[i].replace("وهو ابن","بن")
    if(sent_split[i].__contains__("هو ابن")):
        sent_split[i] = sent_split[i].replace("هو ابن","بن")
    if(sent_split[i].__contains__("يعني ابن")):
        sent_split[i] = sent_split[i].replace("يعني ابن","بن")
        
splitWord=[]
for i in range(len(sent_split)):
    splitWord.append(sent_split[i].split())
 
    

nameList=[]
count=0


WordReplace=["حدثني","وحدثنا","حدثنا","أخبرني","أخبرنا","اخبرنا","حديثه","أخبره","اخبرني","وحدثني","وأخبرني"]


for i in range(len(splitWord)):
    label=ner.predict_sentence(splitWord[i])
    print(list(zip(splitWord[i],label)))
    
    #New Code and comment the below RAsool name
    # if(sent_split[i].__contains__('النبي صلى الله عليه وسلم') or sent_split[i].__contains__('رسول الله صلى الله عليه وسلم')):
        
    #     nameList.append("محمد صلی اللہ علیہ وآلہ وسلم")
    #     count=1
    #     break
    
    dum=''
    for j in range(len(label)):
        if(splitWord[i][j] in WordReplace):
            continue
        if (label[j]=="B-PERS" or label[j]=="I-PERS"):
            dum =dum+splitWord[i][j]+' '
        else:
            if(dum !=''):
                nameList.append(dum)
                dum=''
            #Hear From Father Mother Etc
            
            if(splitWord[i][j]=="أبيه"):
                nameList.append("أبيه")
                
            # #Rasool Name Recong From Tokens
                
            if(splitWord[i][j] =="النبي"):
                if(splitWord[i][j+1]=='صلى' and splitWord[i][j+2]=='الله' and splitWord[i][j+3]=='عليه' and splitWord[i][j+4]=='وسلم'):
                    nameList.append("محمد صلی اللہ علیہ وآلہ وسلم")
                    # count=1
                    # break
            if(splitWord[i][j] =="رسول"):
                if(splitWord[i][j+1]=='الله' and splitWord[i][j+2]=='صلى' and splitWord[i][j+3]=='الله' and splitWord[i][j+4]=='عليه' and splitWord[i][j+5]=='وسلم'):
                    nameList.append("محمد صلی اللہ علیہ وآلہ وسلم")
                    # count=1
                    # break
            if(splitWord[i][j] =="محمد" and splitWord[i][j+1]=='صلى'):
                if(splitWord[i][j+2]=='اللہ' and splitWord[i][j+3]=='علیہ' and splitWord[i][j+4]=='وآلہ' and splitWord[i][j+4]=='وسلم'):
                    nameList.append("محمد صلی اللہ علیہ وآلہ وسلم")
            #         count=1
            #         break
            if(splitWord[i][j] =="يا"):
                if(splitWord[i][j+1]=='رسول' and splitWord[i][j+2]=='الله'):
                    nameList.append("محمد صلی اللہ علیہ وآلہ وسلم")
                    # count=1
                    # break
                
                
                print(dum)
    # if(count==1):
    #     break
    
    nameList.append(dum)
    dum=''

